<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Mosh and creates a PKG.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.pkg.mosh</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Mosh</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.Lotusshaney.download.mosh</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>usr</key>
						<string>0755</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/expanded</string>
					<key>flat_pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/mosh-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/usr/</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/expanded/edu.mit.mosh.mosh.pkg/Payload</string>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>wheel</string>
								<key>user</key>
								<string>root</string>
								<key>path</key>
								<string>usr</string>
							</dict>
						</array>
						<key>pkgname</key>
						<string>mosh-%version%</string>
						<key>id</key>
						<string>edu.mit.mosh.mosh.pkg</string>
						<key>version</key>
						<string>%version%</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
						<key>destination</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%/mosh-%version%.pkg</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/expanded</string>
						<string>%RECIPE_CACHE_DIR%/Mosh</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
