<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Sketch and imports it into Munki as a pkg.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.munki.Sketch-pkg</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>Sketch</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Sketch is a toolkit made by designers, for designers, that puts the focus on you and your work.</string>
				<key>developer</key>
				<string>Sketch</string>
				<key>display_name</key>
				<string>Sketch</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.homebysix.pkg.Sketch</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installs</key>
						<array>
							<dict>
								<key>path</key>
								<string>/Applications/Sketch.app</string>
								<key>type</key>
								<string>application</string>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
			<dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
						<string>%RECIPE_CACHE_DIR%/Sketch</string>
                    </array>
                </dict>
            </dict>
		</array>
	</dict>
</plist>