<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest 'The Unarchiver' and imports into Munki. Note: this recipe has issues with repeated runs due to a bug in curl starting with OS X 10.10.5. This has been fixed for the next version of AutoPkg, but not yet in a released version. It should still download and unzip properly if is it is the first run, without an already-downloaded file. The application's LSMinimumSystemVersion is currently inaccurate, but the sparkle:minimumSystemVersion element is correct, so we use MunkiPkginfoMerger to merge the minimum_os_version that is output from SparkleUpdateInfoProvider in the .download ParentRecipe.</string>
        <key>Identifier</key>
        <string>com.github.Lotusshaney.munki.TheUnarchiver-pkg</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>TheUnarchiver</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>The Unarchiver is a much more capable replacement for "Archive Utility.app", the built-in archive unpacker program on Mac OS X. The Unarchiver is designed to handle many more formats than Archive Utility, and to better fit in with the design of the Finder.</string>
                <key>display_name</key>
                <string>The Unarchiver</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
            </dict>
            <key>pkginfo_keys_to_copy_from_sparkle_feed</key>
            <array>
                <string>minimum_os_version</string>
            </array>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.TheUnarchiver</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>/Applications/The Unarchiver.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%version%</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/TheUnarchiver</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>