<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Adobe's Creative Cloud Installer uploads to munki as a PKG.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.munki.AdobeCreativeCloudInstallerUniversal-pkg</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Adobe</string>
			<key>NAME</key>
			<string>AdobeCreativeCloudInstaller-Universal</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Adobe Creative Cloud gives users access to a collection of software developed by Adobe for graphic design, video editing, web development, photography, and cloud services.</string>
				<key>developer</key>
				<string>Adobe</string>
				<key>display_name</key>
				<string>Adobe Creative Cloud</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.Lotusshaney.pkg.AdobeCreativeCloudInstallerUniversal</string>
		<key>Process</key>
		<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>path</key>
							<string>/Applications/Utilities/Adobe Creative Cloud/ACC/Creative Cloud.app</string>
							<key>type</key>
							<string>application</string>
							<key>CFBundleShortVersionString</key>
							<string>%version%</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		</array>
	</dict>
</plist>