<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Refinitiv Workspace and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.Lotusshaney.pkg.RefinitivWorkspace</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Refinitiv Workspace</string>
		<key>NAME</key>
		<string>Refinitiv Workspace</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Refinitiv Workspace</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
