<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Addigy's MDM Watchdog.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.download.mdm-watchdog</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>mdm-watchdog</string>
			<key>PKG_URL</key>
			<string>https://agents.addigy.com/tools/mdm-watchdog/latest/mdm-watchdog.pkg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.7.2</string>
		<key>Process</key>
		<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Consider switching to the MDM-Watchdog recipes in the kevinmcox-recipes repo. This recipe is deprecated and will be removed in the future.</string>
			</dict>
		</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%PKG_URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
