<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Murus.</string>
	<key>Identifier</key>
	<string>com.github.Lotusshaney.download.murus</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>murus</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*\.zip$</string>
				<key>github_repo</key>
				<string>TheMurusTeam/Murus</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/Downloads/%NAME%-%version%.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Downloads/</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/Downloads/%NAME% %version%.dmg</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/Downloads/%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
	</array>
</dict>
</plist>
