<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Telegram Desktop and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.pkg.TelegramDesktop</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Telegram Desktop</string>
			<key>BUNDLE_ID</key>
			<string>com.tdesktop.Telegram</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.Lotusshaney.download.TelegramDesktop</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%pathname%/Telegram.app</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/%NAME%.app</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>admin</string>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>id</key>
						<string>%BUNDLE_ID%</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgname</key>
						<string>Telegram_Desktop-%version%</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>