<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest universal version of 1Password8 and creates a package with a improved Post Installer.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.pkg.1Password8</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>1Password</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>io.github.hjuutilainen.download.1Password8</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>pkgdirs</key>
					<dict/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications</string>
					<key>pkgdirs</key>
					<dict/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
					<key>pkgdirs</key>
					<dict/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
					<key>file_mode</key>
					<string>0755</string>
					<key>file_content</key>
					<string>#!/bin/bash

if /usr/bin/pgrep -ix "1Password" ; then
	touch /tmp/1pw_killed
fi

exit 0</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
					<key>file_mode</key>
					<string>0755</string>
					<key>file_content</key>
					<string><![CDATA[#!/bin/bash

#Define Func
runAsUser() {
currentUser=$( echo "show State:/Users/ConsoleUser" | scutil | awk '/Name :/ { print $3 }' )
uid=$(id -u "$currentUser")
if [[ -n "$currentUser" && "$currentUser" != "loginwindow" ]]; then
	launchctl asuser "$uid" sudo -u "$currentUser" "$@"
fi
}

#Output temp launchD item
cat << 'EOL' > /tmp/1pwstart.plist
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Label</key>
	<string>com.github.Lotusshaney.1pwstart</string>
	<key>ProgramArguments</key>
	<array>
		<string>/usr/bin/open</string>
		<string>-a</string>
		<string>/Applications/1password.app</string>
	</array>
	<key>RunAtLoad</key>
	<true/>
</dict>
</plist>
EOL
chmod 644 /tmp/1pwstart.plist

#Open 1Password 8 if it was open already
if [[ -e /tmp/1pw_killed ]] ; then
	runAsUser launchctl load /tmp/1pwstart.plist
	sleep 2
	runAsUser launchctl unload /tmp/1pwstart.plist
	rm -rf /tmp/1pw_killed /tmp/1pwstart.plist
fi

exit 0
					]]></string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/1Password.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/com.1password.1password.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/1Password.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>wheel</string>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
							</dict>
							<dict>
								<key>group</key>
								<string>wheel</string>
								<key>mode</key>
								<string>0755</string>
								<key>path</key>
								<string>Applications/1Password.app</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>version</key>
						<string>%version%</string>
						<key>id</key>
						<string>com.1password.1password</string>
						<key>scripts</key>
						<string>%RECIPE_CACHE_DIR%/Scripts</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/payload</string>
						<key>options</key>
						<string>purge_ds_store</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack/</string>
						<string>%RECIPE_CACHE_DIR%/Scripts/</string>
						<string>%RECIPE_CACHE_DIR%/payload/</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>