<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest &apos;Slack&apos; and imports into Munki as a PKG.</string>
	<key>Identifier</key>
	<string>com.github.Lotusshaney.munki.slack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
			<key>display_name</key>
			<string>Slack</string>
			<key>category</key>
			<string>Communication</string>
			<key>developer</key>
			<string>Slack</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.killahquam.pkg.slack</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Arguments</key>
		<dict>
			<key>additional_pkginfo</key>
			<dict>
				<key>installs</key>
				<array>
					<dict>
						<key>path</key>
						<string>/Applications/Slack.app</string>
						<key>type</key>
						<string>application</string>
						<key>CFBundleShortVersionString</key>
						<string>%version%</string>
					</dict>
				</array>
			</dict>
		</dict>
		<key>Processor</key>
		<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
