<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Sublime Text 4, builds a package, and imports into Munki as a PKG.</string>
        <key>Identifier</key>
        <string>com.github.Lotusshaney.munki.SublimeText4-pkg</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>SublimeText4</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/SublimeText</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Text Editors</string>
                <key>description</key>
                <string>Text Editing, Done Right</string>
                <key>developer</key>
                <string>Sublime HQ Pty Ltd</string>
                <key>display_name</key>
                <string>Sublime Text 4</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gregneagle.pkg.SublimeText4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Sublime Text.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleVersion</string>
                </dict>
            </dict>
            <dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installs</key>
						<array>
							<dict>
								<key>path</key>
								<string>/Applications/Sublime Text.app</string>
								<key>type</key>
								<string>application</string>
								<key>CFBundleVersion</key>
								<string>%version%</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleVersion</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/SublimeText4</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>