<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest NVIDIA Nsight Systems for macOS.</string>
        <key>Identifier</key>
        <string>com.github.Lotusshaney.download.nsightsystems</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>NVIDIA Nsight Systems</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://developer.nvidia.com/nsight-systems/get-started</string>
                    <key>re_pattern</key>
                    <string>https://developer\.nvidia\.com/downloads/assets/tools/secure/nsight-systems/[^"]+\.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>