<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Circonus Unified Agent (CUA) uploads to munki as a PKG. Needed variables are API_KEY and DATA_COLLECTION_INTERVAL</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.munki.CirconusUnifiedAgent-pkg</string>
		<key>Input</key>
		<dict>
			<key>API_KEY</key>
			<string></string>
			<key>DATA_COLLECTION_INTERVAL</key>
			<string></string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Circonus</string>
			<key>NAME</key>
			<string>Circonus Unified Agent</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>The Circonus Unified Agent (CUA) is a lightweight GoLang-based application that reports metrics from a host, container, cloud, etc. that it is installed on</string>
				<key>developer</key>
				<string>Circonus</string>
				<key>display_name</key>
				<string>Circonus Unified Agent</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.wegotoeleven-recipes.pkg.CirconusUnifiedAgent</string>
		<key>Process</key>
		<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		</array>
	</dict>
</plist>