<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Nextcloud.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.download.Nextcloud</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>NextCloud</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>.*\.pkg$</string>
					<key>github_repo</key>
					<string>nextcloud-releases/desktop</string>
				</dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Nextcloud GmbH (NKUJUXUJ3B)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads//%NAME%-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
