<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Nextcloud Desktop Client and imports it into Munki.</string>
	<key>Identifier</key>
	<string>uk.co.designed79.munki.nextcloud</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>Nextcloud</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>nextcloud.app</string>
				<string>QtWebEngineProcess.app</string>
			</array>
			<key>preinstall_script</key>
			<string>#!/bin/bash
pkill -9 -i nextcloud
rm -rf /Applications/Nextcloud.app
exit 0</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A safe home for all your data. Access, share and protect your files, calendars, contacts, mail &amp; more from any device, on your terms.</string>
			<key>developer</key>
			<string>Nextcloud GmbH</string>
			<key>display_name</key>
			<string>Nextcloud Desktop Client</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>uk.co.designed79.download.nextcloud</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
