<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of PyCharm Professional Edition and imports it into Munki as a PKG.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.munki.pycharmpe-pkg</string>
		<key>Comment</key>
		<string>For the ARCH_TYPE variable use "mac" for Intel, use "macM1" for Apple Silicon</string>
		<key>Comment</key>
		<string>And for the SUPPORTED_ARCH variable use "x86_64" for Intel, use "arm64" for Apple Silicon.  NOTE: BOTH ARCH_TYPE and SUPPORTED_ARCH MUST be set</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>PyCharm Professional Edition</string>
			<key>ARCH_TYPE</key>
			<string>macM1</string>
			<key>SUPPORTED_ARCH</key>
			<string>arm64</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%/%SUPPORTED_ARCH%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Python IDE for professional developers

https://www.jetbrains.com/pycharm</string>
				<key>developer</key>
				<string>JetBrains</string>
				<key>display_name</key>
				<string>PyCharm Professional Edition</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>supported_architectures</key>
				<array>
					<string>%SUPPORTED_ARCH%</string>
				</array>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
				<key>uninstallable</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.Lotusshaney.pkg.pycharmpe</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installs</key>
						<array>
							<dict>
								<key>path</key>
								<string>/Applications/PyCharm.app</string>
								<key>type</key>
								<string>application</string>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%SUPPORTED_ARCH%-%version%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
