<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of CrealityPrint and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.Lotusshaney.munki.CrealityPrint</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Creality Print</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>CrealityPrint</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Creality Print is a free, open-source FDM (Fused Deposition Modeling) 3D printing slicing software developed by Creality that converts 3D models into G-code for their printers.</string>
			<key>developer</key>
			<string>Shenzhen Creality 3D Technology Co</string>
			<key>display_name</key>
			<string>CrealityPrint</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.Lotusshaney.download.CrealityPrint</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
