<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of RStudio and imports it into Munki as a pkg.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.munki.RStudio-pkg</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>RStudio</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Used by millions of people weekly, the RStudio integrated development environment (IDE) is a set of tools built to help you be more productive with R and Python.</string>
				<key>developer</key>
				<string>RStudio</string>
				<key>display_name</key>
				<string>RStudio</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true />
				<key>version_script</key>
				<string><![CDATA[#!/bin/bash

# Broken Version Retriver Script

APP="/Applications/RStudio.app"
INFO="${APP}/Contents/Info.plist"

if [[ -e "${INFO}" ]]; then
    version=$(/usr/bin/plutil -extract CFBundleShortVersionString raw "${INFO}" 2>/dev/null )
fi

#Process version string
if [[ -n "${version}" ]]; then
    echo "${version}" | /usr/bin/awk -F '+' '{print $1}'
fi

exit 0]]></string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.rtrouton.pkg.RStudio</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installs</key>
						<array>
							<dict>
								<key>path</key>
								<string>/Applications/RStudio.app</string>
								<key>type</key>
								<string>application</string>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>