<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tailscale and imports it into Munki as a PKG.</string>
	<key>Identifier</key>
	<string>com.github.Lotusshaney.munki.Tailscale</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Tailscale</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A secure network that just works - Zero config VPN. Installs on any device in minutes, manages firewall rules for you, and works from anywhere.</string>
			<key>developer</key>
			<string>Tailscale</string>
			<key>display_name</key>
			<string>Tailscale</string>
			<key>category</key>
			<string>Remote Access</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>Tailscale</string>
			</array>
			<key>developer</key>
			<string>Tailscale</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.Lotusshaney.pkg.Tailscale</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Arguments</key>
		<dict>
			<key>additional_pkginfo</key>
			<dict>
				<key>installs</key>
				<array>
					<dict>
						<key>path</key>
						<string>/Applications/Tailscale.app</string>
						<key>type</key>
						<string>application</string>
						<key>CFBundleShortVersionString</key>
						<string>%version%</string>
					</dict>
				</array>
			</dict>
		</dict>
		<key>Processor</key>
		<string>MunkiPkginfoMerger</string>
	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
