<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of SourceTree and imports into Munki as a PKG.</string>
	<key>Identifier</key>
	<string>com.github.Lotusshaney.munki.SourceTree</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SourceTree</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Atlassian</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>SourceTree is a free Mercurial and Git client for Windows and Mac that provides a graphical interface for your Hg and Git repositories.</string>
			<key>developer</key>
			<string>Atlassian</string>
			<key>display_name</key>
			<string>SourceTree</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh

if [[ -e /usr/local/bin/stree ]]; then
    /bin/rm -f /usr/local/bin/stree
fi

exit 0
			</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh
/bin/chmod -R 755 /Applications/SourceTree.app
/bin/cp -f /Applications/SourceTree.app/Contents/Resources/stree /usr/local/bin/stree
exit 0
			</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>SourceTree</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.SourceTree</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Arguments</key>
		<dict>
			<key>additional_pkginfo</key>
			<dict>
				<key>installs</key>
				<array>
					<dict>
						<key>path</key>
						<string>/Applications/SourceTree.app</string>
						<key>type</key>
						<string>application</string>
						<key>CFBundleShortVersionString</key>
						<string>%version%</string>
					</dict>
				</array>
			</dict>
		</dict>
		<key>Processor</key>
		<string>MunkiPkginfoMerger</string>
	</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
