<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Visual Studio Code and imports into Munki as a PKG.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.munki.visualstudiocode</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Visual Studio Code</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Visual Studio Code is a lightweight but powerful source code editor which runs on your desktop and is available for Windows, macOS and Linux.</string>
				<key>display_name</key>
				<string>Visual Studio Code</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>blocking_applications</key>
				<array>
					<string>Visual Studio Code.app</string>
				</array>
				<key>developer</key>
				<string>Microsoft</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.amsysuk-recipes.pkg.VisualStudioCode</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installs</key>
						<array>
							<dict>
								<key>path</key>
								<string>/Applications/Visual Studio Code.app</string>
								<key>type</key>
								<string>application</string>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
