<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Visual Studio Code and imports into Munki as a PKG.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.munki.visualstudiocode</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Visual Studio Code</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Visual Studio Code is a lightweight but powerful source code editor which runs on your desktop and is available for Windows, macOS and Linux.</string>
				<key>display_name</key>
				<string>Visual Studio Code</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>blocking_applications</key>
				<array>
					<string>Visual Studio Code.app</string>
				</array>
				<key>developer</key>
				<string>Microsoft</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.Lotusshaney.pkg.visualstudiocode</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installs</key>
						<array>
							<dict>
								<key>path</key>
								<string>/Applications/Visual Studio Code.app</string>
								<key>type</key>
								<string>application</string>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
							</dict>
						</array>
						<key>postinstall_script</key>
	<string>#!/bin/bash

# Script to change ownership of the .vscode directory in each user's home directory

# Exit Codes
# 0: Success
# 95: Not running as root

# Variables
LOG_PROCESS="fix_vscode_ownership"

#Functions
writeLog() {
    # Write to system log
    /usr/bin/logger -is -t "${LOG_PROCESS}" "[${LOG_PROCESS}] ${1}"
}

root_check() {
    if [[ "$(/usr/bin/id -u)" != "0" ]] ; then
        writeLog "${LOG_PROCESS} MUST run as root..."
        exit 95
    fi
}

main() {
    # Get a list of all user directories in /Users, excluding some directories
    for USER in $(/usr/bin/dscl . -list /Users UniqueID | /usr/bin/awk '$2 &gt; 500 { print $1 }'); do
        
        # Define the user's home directory
        USER_DIR=$(/usr/bin/dscl . -read "/Users/${USER}" NFSHomeDirectory | awk '{print $2}')

        # Define the .vscode directory path for this user
        VSCODE_DIR="${USER_DIR}/.vscode"

        # Check if the .vscode directory exists
        if [[ -d "${VSCODE_DIR}" ]]; then
            writeLog "Changing ownership of ${VSCODE_DIR} to ${USER}"
            /usr/sbin/chown -R "${USER}":staff "${VSCODE_DIR}"
        else
            writeLog "Skipping: No .vscode directory found for ${USER}"
        fi

        # Define the Code directory path for this user
        VSCODE_LIB_DIR="${USER_DIR}/Library/Application Support/Code"
        
        # Check if the Code directory exists
        if [[ -d "${VSCODE_LIB_DIR}" ]]; then
            writeLog "Changing ownership of ${VSCODE_LIB_DIR} to ${USER}"
            /usr/sbin/chown -R "${USER}":staff "${VSCODE_LIB_DIR}"
        else
            writeLog "Skipping: No Code directory found for ${USER}"
        fi
    done
}

# Main
root_check
main
writeLog "${LOG_PROCESS} complete."

exit 0</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
