<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of DBeaver Community and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.pkg.DBeaver Community Edition</string>
		<key>Input</key>
		<dict>
			<key>os</key>
			<string>macos</string>
			<key>APP_FILENAME</key>
			<string>DBeaver-CE</string>
			<key>NAME</key>
			<string>DBeaver Community</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.peshay.download.DBeaverCE</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/dbeaver_ce-%version%.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>