<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Imports DBeaver Community Edition into Munki as a pkg.</string>
        <key>Identifier</key>
        <string>com.github.Lotusshaney.munki.DBeaver Community Edition-pkg</string>
        <key>Input</key>
        <dict>
            <key>APP_FILENAME</key>
            <string>DBeaver-CE</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>DBeaver Community Edition</string>
            <key>os</key>
            <string>macos-x86_64</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Free multi-platform database tool for developers, SQL programmers, database administrators and analysts. Supports all popular databases: MySQL, PostgreSQL, MariaDB, SQLite, Oracle, DB2, SQL Server, Sybase, MS Access, Teradata, Firebird, Derby, etc.</string>
                <key>developer</key>
                <string>DBeaver Corp</string>
                <key>display_name</key>
                <string>DBeaver Community Edition</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.Lotusshaney.pkg.DBeaver Community Edition</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/DBeaver.app</string>
                    <key>requirement</key>
                    <string>identifier "org.jkiss.dbeaver.core.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "42B6MDKMW8"</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>/Applications/DBeaver.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%version%</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/dbeaver_ce-%version%.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>