<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Packages the latest version of the Smallstep Step CLI tool as a Universal PKG with both Arm and x86 installers</string>
    <key>Identifier</key>
    <string>com.github.Lotusshaney.pkg.step-cli-uni</string>
    <key>ParentRecipe</key>
    <string>com.github.Lotusshaney.download.step-cli-uni</string>
    <key>Input</key>
    <dict>
      <key>PUBLISHER</key>
      <string>com.github.smallstep.step</string>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>StopProcessingIf</string>
        <key>Arguments</key>
        <dict>
            <key>predicate</key>
            <string>download_changed == FALSE</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkgdirs</key>
          <dict>
            <key>usr</key>
            <string>0775</string>
            <key>usr/local</key>
            <string>0775</string>
            <key>usr/local/bin</key>
            <string>0775</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/step_darwin_%version%_arm64.tar.gz</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
          <key>pattern</key>
          <string>%RECIPE_CACHE_DIR%/unpack/*/bin/%NAME%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%found_filename%</string>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/bin/%NAME%</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgroot</key>
            <string>%pkgroot%</string>
            <key>pkgdir</key>
            <string>%RECIPE_CACHE_DIR%</string>
            <key>pkgname</key>
            <string>%NAME%-%version%-arm64</string>
            <key>pkgtype</key>
            <string>flat</string>
            <key>id</key>
            <string>%PUBLISHER%</string>
            <key>version</key>
            <string>%version%</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>usr</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local/bin</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local/bin/%NAME%</string>
                <key>mode</key>
                <string>0755</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unpack/</string>
            <string>%RECIPE_CACHE_DIR%/payload/</string>
          </array>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkgdirs</key>
          <dict>
            <key>usr</key>
            <string>0775</string>
            <key>usr/local</key>
            <string>0775</string>
            <key>usr/local/bin</key>
            <string>0775</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/step_darwin_%version%_amd64.tar.gz</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
          <key>pattern</key>
          <string>%RECIPE_CACHE_DIR%/unpack/*/bin/%NAME%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%found_filename%</string>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/bin/%NAME%</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgroot</key>
            <string>%pkgroot%</string>
            <key>pkgdir</key>
            <string>%RECIPE_CACHE_DIR%</string>
            <key>pkgname</key>
            <string>%NAME%-%version%-amd64</string>
            <key>pkgtype</key>
            <string>flat</string>
            <key>id</key>
            <string>%PUBLISHER%</string>
            <key>version</key>
            <string>%version%</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>usr</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local/bin</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local/bin/%NAME%</string>
                <key>mode</key>
                <string>0755</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unpack/</string>
            <string>%RECIPE_CACHE_DIR%/payload/</string>
          </array>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkgdirs</key>
          <dict/>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/Universal/Scripts</string>
        </dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkgdirs</key>
          <dict/>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/Universal/pkgroot</string>
        </dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>overwrite</key>
          <false/>
          <key>source</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%-amd64.pkg</string>
          <key>target</key>
          <string>%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-%version%-amd64.pkg</string>
        </dict>
        <key>Processor</key>
        <string>FileMover</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>overwrite</key>
          <false/>
          <key>source</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%-arm64.pkg</string>
          <key>target</key>
          <string>%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-%version%-arm64.pkg</string>
        </dict>
        <key>Processor</key>
        <string>FileMover</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>file_content</key>
          <string>#!/bin/zsh
# Determine working directory
installDir=$(dirname $0)

# Identify installer package names 
Intel_package="%NAME%-%version%-amd64.pkg"
Apple_Silicon_package="%NAME%-%version%-arm64.pkg"

# Determine if this Mac has an Intel or Apple Silicon processor
processor=$(/usr/bin/uname -m | grep -o "x86_64")

if [[ -n "$processor" ]]; then
  /usr/sbin/installer -pkg "$installDir"/"$Intel_package" -target "$3"
else
  /usr/sbin/installer -pkg "$installDir"/"$Apple_Silicon_package" -target "$3"
fi

exit 0
          </string>
          <key>file_mode</key>
          <string>0755</string>
          <key>file_path</key>
          <string>%RECIPE_CACHE_DIR%/Universal/Scripts/preinstall</string>
        </dict>
        <key>Processor</key>
        <string>FileCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>id</key>
            <string>com.github.smallstep.step.universal</string>
            <key>options</key>
            <string>purge_ds_store</string>
            <key>pkgname</key>
            <string>%NAME%-%version%-Universal</string>
            <key>scripts</key>
            <string>%RECIPE_CACHE_DIR%/Universal/Scripts</string>
            <key>version</key>
            <string>%version%</string>
          </dict>
        </dict>
        <key>Processor</key>
        <string>PkgCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/Universal</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
      </dict>
    </array>
  </dict>
</plist>