<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest versions of both the Arm and x86 Smallstep KMS tool.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.download.step-kms-uni</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>step-kms-plugin</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>%NAME%_([0-9.]+)\_darwin_arm64\.tar\.gz</string>
					<key>github_repo</key>
					<string>smallstep/step-kms-plugin</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>%NAME%_([0-9.]+)\_darwin_amd64\.tar\.gz</string>
					<key>github_repo</key>
					<string>smallstep/step-kms-plugin</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
