<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of the UV / UVX CLI tools</string>
		<key>Comment</key>
		<string>Need to specify x86_64 or aarch64 accordingly in the ARCH variable.</string>
		<key>Identifier</key>
		<string>com.github.Lotusshaney.download.uv</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>uv</string>
			<key>ARCH</key>
			<string>aarch64</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>^%NAME%-%ARCH%-apple-darwin\.tar\.gz$</string>
					<key>github_repo</key>
					<string>astral-sh/uv</string>
					<key>include_prereleases</key>
					<false />
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>