<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Packages the latest version of the UV / UVX CLI tool</string>
    <key>Identifier</key>
    <string>com.github.Lotusshaney.pkg.uv</string>
    <key>ParentRecipe</key>
    <string>com.github.Lotusshaney.download.uv</string>
    <key>Input</key>
    <dict>
      <key>PUBLISHER</key>
      <string>com.github.astral-sh.uv</string>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkgdirs</key>
          <dict>
            <key>usr</key>
            <string>0775</string>
            <key>usr/local</key>
            <string>0775</string>
            <key>usr/local/bin</key>
            <string>0775</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
          <key>pattern</key>
          <string>%RECIPE_CACHE_DIR%/unpack/%NAME%-%ARCH%-apple-darwin/</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%found_filename%</string>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/bin/</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgroot</key>
            <string>%pkgroot%</string>
            <key>pkgdir</key>
            <string>%RECIPE_CACHE_DIR%</string>
            <key>pkgname</key>
            <string>%NAME%-%version%</string>
            <key>pkgtype</key>
            <string>flat</string>
            <key>id</key>
            <string>%PUBLISHER%</string>
            <key>version</key>
            <string>%version%</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>usr</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local/bin</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>usr/local/bin/%NAME%</string>
                <key>mode</key>
                <string>0755</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unpack/</string>
            <string>%RECIPE_CACHE_DIR%/payload/</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
