<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Comment</key>
        <string>Set MUNKI_ARCHITECTURE to "arm64" for Apple Silicon or "x86_64" for Intel.</string>
        <key>Description</key>
        <string>Downloads the latest version of 8x8 Work and imports it into Munki as a PKG. Based on arubdesu 8x8 recipes.</string>
        <key>Identifier</key>
        <string>com.github.Lotusshaney.munki.8x8Work-pkg</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_ARCHITECTURE</key>
            <string>arm64</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>8x8 Work</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>8x8 Work is a comprehensive unified communications application that integrates a business softphone with visual voicemail, corporate directory, instant messaging, presence, video calling, fax, call recording, and web conferencing—all in a standalone desktop application. Use your Mac or smartphone to make calls, join video conferences or online meetings, chat, manage voicemails, access your company directory, and more.</string>
                <key>developer</key>
                <string>8x8, Inc.</string>
                <key>display_name</key>
                <string>8x8 Work</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>supported_architectures</key>
                <array>
                    <string>%MUNKI_ARCHITECTURE%</string>
                </array>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.arubdesu.pkg.8x8Work</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Comment</key>
                <string>If the MUNKI_ARCHITECTURE is not set, then the recipe will stop here</string>
                <key>Processor</key>
                <string>StopProcessingIf</string>
                <key>Arguments</key>
                <dict>
                    <key>predicate</key>
                    <string>%MUNKI_ARCHITECTURE% != arm64 AND %MUNKI_ARCHITECTURE% != x86_64</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>/Applications/8x8 Work.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%version%</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
