<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Telegram and imports it into a munki_repo as a PKG.</string>
        <key>Identifier</key>
        <string>com.github.Lotusshaney.munki.Telegram-pkg</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_CATEGORY</key>
            <string>Communication</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/telegram</string>
            <key>NAME</key>
            <string>Telegram</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Telegram is a cloud-based mobile and desktop messaging app with a focus on security and speed.</string>
                <key>developer</key>
                <string>Telegram</string>
                <key>display_name</key>
                <string>Telegram</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.moofit-recipes.pkg.Telegram</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>/Applications/Telegram.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%version%</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
